#include <stdio.h>

int main() {
    int arr[12];  // Массив для хранения 12 чисел
    int temp[4];  // Временный массив для хранения последних 4 элементов

    // Ввод чисел с клавиатуры
    for (int i = 0; i < 12; ++i) {
        scanf("%d", &arr[i]);
    }

    // Запоминаем последние 4 элемента массива
    for (int i = 0; i < 4; ++i) {
        temp[i] = arr[8 + i];  // Индексы 8, 9, 10, 11
    }

    // Сдвигаем элементы на 4 позиции вправо
    for (int i = 11; i >= 4; --i) {
        arr[i] = arr[i - 4];
    }

    // Помещаем последние 4 элемента в начало массива
    for (int i = 0; i < 4; ++i) {
        arr[i] = temp[i];
    }

    // Выводим результат
    for (int i = 0; i < 12; ++i) {
        printf("%d ", arr[i]);
    }
    printf("\n");

    return 0;
}

//E10
